app/controllers/users_controller.rb

  def login
    @user = User.find_by(username: params[:username])
---
SELECT "users".* FROM "users" WHERE "users"."username" = $1 LIMIT $2  [["username", "teamrose"], ["LIMIT", 1]]